{"class_name": "Sequential", "keras_version": "2.1.6", "config": [{"class_name": "InputLayer", "config": {"sparse": false, "batch_input_shape": [null, 32, 32, 3], "dtype": "float32", "name": "input_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 32, 32, 3], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "filters": 256, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_1"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_1"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 10, 10, 100], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "filters": 128, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_2"}}, {"class_name": "MaxPooling2D", "config": {"padding": "valid", "trainable": true, "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "name": "max_pooling2d_2"}}, {"class_name": "Conv2D", "config": {"kernel_constraint": null, "kernel_size": [3, 3], "dtype": "float32", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "dilation_rate": [1, 1], "batch_input_shape": [null, 1, 1, 10], "padding": "valid", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "use_bias": true, "bias_constraint": null, "filters": 64, "activation": "relu", "bias_regularizer": null, "activity_regularizer": null, "data_format": "channels_last", "strides": [1, 1], "name": "conv2d_3"}}, {"class_name": "Flatten", "config": {"data_format": "channels_last", "trainable": true, "name": "flatten_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 256, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "relu", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 64, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_2"}}, {"class_name": "Dense", "config": {"kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "mode": "fan_avg", "scale": 1.0, "distribution": "uniform"}}, "trainable": true, "activation": "softmax", "bias_initializer": {"class_name": "Zeros", "config": {}}, "units": 3, "kernel_constraint": null, "kernel_regularizer": null, "use_bias": true, "bias_constraint": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_3"}}], "backend": "tensorflow"}